package nix_beginner_test;

public class Question_13 {

    /*
      Сопоставьте описание и соответствующий тип данных:

      1) ✔ SET (множество) - тип данных, который позволяет хранить ограниченное число значений определенного типа без определенного порядка и без повторений.
      2) ✔ MAP ("ассоциативный массив" или "словарь") - тип данных, позволяющий хранить пары вида «(ключ, значение)» и поддерживающий операции добавления пары,
      а также поиска и удаления пары по ключу.
      3) ✔ TREE (дерево или граф) - тип данных, который представляет собой набор связанных неориентированных узлов и соединений между ними.
      4) ✔ ARRAY - тип данных, хранящий набор значений (элементов), идентифицируемых по индексу или набору индексов, принимающих целые (или приводимые к целым) значения
       из некоторого заданного непрерывного диапазона.
    */
}
