package nix_beginner_test;

public class Question_30 {

    /*
     НТМL - это ...
     Выберите один ответ:

     1) язык структурной разметки
     2) язык программирования
     3) язык гипертекстовой разметки ✔
     4) язык редактирования

     HTML (HyperText Markup Language) - это стандартный язык разметки, используемый для создания и структурирования веб-страниц.
     Он предоставляет набор элементов (тегов), которые определяют структуру и содержание веб-документа.
     HTML является основой для создания веб-сайтов и веб-приложений.
    */
}
