package nix_beginner_test;

public class Question_11 {

    /*
      Оцените сложность алгоритма:
      int y = x^2 +5*x;

      1) 𝑓𝑛=𝑂(1) ✔
      2) 𝑓𝑛=𝑂(𝑛)
      3) 𝑓𝑛=𝑂(𝑛^2)
      4) 𝑓𝑛=𝑂(2^𝑛)
      5) 𝑓𝑛=𝑂(𝑙𝑜𝑔𝑛)

      Сложность алгоритма определяется количеством операций, которые нужно выполнить в зависимости от размера входных данных.
      Оценить сложность алгоритма можно с помощью анализа кода и определения количества итераций циклов,
      количества операций условий, рекурсивных вызовов и так далее.
      Оценка сложности помогает понять, насколько быстро или медленно алгоритм будет выполняться при увеличении объема данных.
    */
}
