package nix_beginner_test;

public class Question_43 {

    /*
      Где компилятор ищет классы необходимые для компиляции java-файлов?
      Выберите один или несколько ответов:

      1) Во всех источниках перечисленных в параметре компилятора -cp ✔
      2) Во всех источниках перечисленных в переменной окружения PATH
      3) Во всех источниках перечисленных в параметре компилятора -classpath ✔
      4) Во всех источниках перечисленных в параметре компилятора -sources
      5) Во всех источниках перечисленных в переменной окружения CLASSPATH ✔
      6) Во всех источниках перечисленных в параметре компилятора -classes

    */
}
