package nix_beginner_test;

public class Question_21 {

    /*
      Что такое HTTP?

      1) Протокол передачи данных, изначально — в виде гипертекстовых документов в формате HTML,
      в настоящее время используется для передачи произвольных данных. ✔
      2) Система унифицированных адресов электронных ресурсов, или единообразный определитель местонахождения ресурса.
      3) Сетевой протокол прикладного уровня для удалённого доступа к файлам, принтерам и другим сетевым ресурсам.
      4) Протокол передачи файлов по сети.

    */
}
