package nix_beginner_test;

public class Question_20 {

    /*
      Выберите наиболее подходящее определение для асинхронного вызова:

      1) Не блокирует выполнение приложения, но после получения результата будет запущена функция обратного вызова (callback) ✔
      2) Блокирует выполнение приложения до момента получения результата

     "Асинхронный вызов" - это метод в программировании, при котором процесс или функция запускается независимо от текущего выполнения программы.
      Вместо блокирования выполнения программы, асинхронный вызов позволяет программе продолжить свою работу и обрабатывать другие задачи,
      в то время как вызываемая операция выполняется в фоновом режиме.
    */
}
