package nix_beginner_test;

public class Question_18 {

    /*
      Гарантирует ли доставку информации и порядок частей протокол UDP?
      Выберите один ответ:

      1) да
      2) нет ✔

      UDP (User Datagram Protocol) не гарантирует надежную доставку информации и порядок частей данных при передаче их по сети.
      UDP является более легковесным протоколом, который обеспечивает более быструю передачу данных.
      Протокол UDP может быть полезным в приложениях, где скорость передачи данных и низкая задержка более важны, чем гарантии надежности и порядка.
      Например: видео или голосовая связь, онлайн-игры и т.д.
    */
}
