package nix_beginner_test;

public class Question_39 {

    /*
      Что такое компиляция?
      Выберите один ответ:

      1) трансляция программы, составленной на исходном языке высокого уровня, в эквивалентную программу на низкоуровневом языке,
      близком к машинному коду ✔
      2) трансляция программы, составленной на исходном языке высокого уровня, в эквивалентную программу на языке Java
      3) процесс сжатия и сборки исходного кода
      4) процесс соединения нескольких файлов с исполняемым кодом программы в один файл

      Компиляция - это процесс преобразования программного кода, написанного на исходном языке высокого уровня,
      в эквивалентный код на низкоуровневом языке, таком как машинный код или другой язык программирования.
    */
}
