package nix_beginner_test;

public class Question_12 {

    /*
      Зіставте опис та відповідний тип даних:

      1) ✔ SET (множество) - тип даних, який дозволяє зберігати обмежену кількість значень певного типу без певного порядку та без повторень.
      2) ✔ MAP ("ассоциативный массив" или "словарь") - тип даних, що дозволяє зберігати пари виду «(ключ, значення)»
      та підтримує операції додавання пари, а також пошуку та видалення пари по ключу.
      3) ✔ TREE (дерево или граф) - тип даних, який являє собою набір пов'язаних неорієнтованих вузлів та з'єднань між ними.
      4) ✔ ARRAY - тип даних, що зберігає набір значень (елементів), що ідентифікуються за індексом або набором індексів,
      що приймають цілі (або цілі) значення з деякого заданого безперервного діапазону.
    */
}
