package nix_beginner_test;

public class Question_41 {

    /*
      Выберите правильное определение понятию "class path"
      Выберите один или несколько ответов:

      1) class path это список JAR-файлов, которые содержат class-файлы ✔
      2) class path это список директорий, которые содержат class-файлы ✔
      3) class path это список директорий, JAR-файлов, которые содержат class-файлы ✔
      4) class path это список директорий, JAR-файлов, ZIP-файлов, которые содержат class-файлы ✔

    */
}
