package nix_beginner_test;

public class Question_28 {

    /*
      Как параметры передаются в GET запросе?

      1) в схеме
      2) в header
      3) в url ✔
      4) в типе
      5) в теле

      Строка запроса начинается с вопросительного знака ? и содержит список параметров, разделенных символом амперсанда &.
      Каждый параметр состоит из имени и значения, разделенных символом равенства =.

      https://example.com - это базовый URL ресурса.
      /path/to/resource - это путь к конкретному ресурсу на сервере.
      ? - начало строки запроса.
      param1=value1, param2=value2, param3=value3 - параметры запроса.
    */
}
