package nix_beginner_test;

public class Question_18 {

    /*
      Гарантирует ли доставку информации и порядок частей протокол TCP?

      1) да ✔
      2) нет

      TCP (Transmission Control Protocol) гарантирует доставку информации и порядок частей данных при передаче данных по сети.
      В контексте сетевых соединений, TCP обеспечивает надежное и устойчивое взаимодействие между устройствами.
      Протокол TCP предоставляет следующие гарантии: надежная доставка, порядок, устранение дубликатов, управление потоком.

    */
}
